In [2]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [5]:
DF_obj = DataFrame({'column 1':[1,1,2,2,3,4,4],
                   'column 2':['a','a','b','b','c','d','d'],
                  'column 3':['A','A','B','B','C','D','D']})

In [6]:
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         4        d        D
6         4        d        D

In [7]:
DF_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5    False
6     True
dtype: bool

In [8]:
DF_obj.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         4        d        D

In [9]:
DF_obj = DataFrame({'column 1':[1,1,2,2,3,4,4],
                    'column 2':['a','a','b','b','c','d','d'],
                    'column 3':['A','A','B','B','C','F','D']})

In [10]:
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         4        d        F
6         4        d        D

In [11]:
DF_obj.drop_duplicates(['column 3'])

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
5         4        d        F
6         4        d        D